n2nresult/pubsub_nosend-11k-20200713103913.txt
wrk -t 20 -c 100 -d30s -R 30000 -file_k 11 --latency http://192.168.1.4:8089
Running 30s test @ http://192.168.1.4:8089
  20 threads and 100 connections
  Thread calibration: mean lat.: 1.045ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.032ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.054ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.019ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.052ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.044ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.017ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.030ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.042ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.022ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.031ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.030ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.014ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.051ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.039ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.048ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.048ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.021ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.044ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.075ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03ms  439.31us   7.41ms   65.82%
    Req/Sec     1.58k   102.13     2.22k    79.31%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%       1.02 ms
 75.000%       1.35 ms
 90.000%       1.60 ms
 99.000%       2.03 ms
 99.900%       2.45 ms
 99.990%       5.09 ms
 99.999%       6.12 ms
100.000%       7.41 ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.126     0.000000            1         1.00
       0.446     0.100000        60048         1.11
       0.631     0.200000       119848         1.25
       0.774     0.300000       179940         1.43
       0.902     0.400000       240056         1.67
       1.023     0.500000       299720         2.00
       1.086     0.550000       330005         2.22
       1.149     0.600000       359552         2.50
       1.215     0.650000       389862         2.86
       1.280     0.700000       419618         3.33
       1.347     0.750000       449671         4.00
       1.382     0.775000       464468         4.44
       1.419     0.800000       479514         5.00
       1.457     0.825000       494378         5.71
       1.499     0.850000       509595         6.67
       1.544     0.875000       524286         8.00
       1.570     0.887500       531932         8.89
       1.599     0.900000       539455        10.00
       1.630     0.912500       546867        11.43
       1.667     0.925000       554363        13.33
       1.712     0.937500       561854        16.00
       1.737     0.943750       565569        17.78
       1.765     0.950000       569319        20.00
       1.795     0.956250       573012        22.86
       1.827     0.962500       576786        26.67
       1.861     0.968750       580515        32.00
       1.880     0.971875       582423        35.56
       1.900     0.975000       584279        40.00
       1.920     0.978125       586142        45.71
       1.942     0.981250       587944        53.33
       1.969     0.984375       589859        64.00
       1.983     0.985938       590792        71.11
       1.998     0.987500       591741        80.00
       2.016     0.989062       592659        91.43
       2.035     0.990625       593572       106.67
       2.059     0.992188       594544       128.00
       2.071     0.992969       594960       142.22
       2.087     0.993750       595475       160.00
       2.103     0.994531       595933       182.86
       2.121     0.995313       596385       213.33
       2.145     0.996094       596848       256.00
       2.159     0.996484       597089       284.44
       2.173     0.996875       597299       320.00
       2.189     0.997266       597534       365.71
       2.213     0.997656       597779       426.67
       2.241     0.998047       598013       512.00
       2.257     0.998242       598120       568.89
       2.281     0.998437       598239       640.00
       2.309     0.998633       598359       731.43
       2.359     0.998828       598471       853.33
       2.469     0.999023       598586      1024.00
       2.593     0.999121       598647      1137.78
       2.741     0.999219       598703      1280.00
       2.947     0.999316       598762      1462.86
       3.181     0.999414       598821      1706.67
       3.475     0.999512       598879      2048.00
       3.637     0.999561       598908      2275.56
       3.841     0.999609       598937      2560.00
       4.005     0.999658       598967      2925.71
       4.179     0.999707       598996      3413.33
       4.427     0.999756       599025      4096.00
       4.575     0.999780       599040      4551.11
       4.683     0.999805       599054      5120.00
       4.787     0.999829       599070      5851.43
       4.899     0.999854       599085      6826.67
       4.995     0.999878       599098      8192.00
       5.079     0.999890       599107      9102.22
       5.115     0.999902       599113     10240.00
       5.231     0.999915       599120     11702.86
       5.343     0.999927       599128     13653.33
       5.459     0.999939       599135     16384.00
       5.511     0.999945       599139     18204.44
       5.551     0.999951       599142     20480.00
       5.599     0.999957       599146     23405.71
       5.683     0.999963       599150     27306.67
       5.691     0.999969       599153     32768.00
       5.731     0.999973       599155     36408.89
       5.743     0.999976       599157     40960.00
       5.779     0.999979       599159     46811.43
       5.879     0.999982       599162     54613.33
       5.879     0.999985       599162     65536.00
       5.883     0.999986       599163     72817.78
       5.967     0.999988       599164     81920.00
       6.119     0.999989       599165     93622.86
       6.179     0.999991       599166    109226.67
       6.195     0.999992       599167    131072.00
       6.195     0.999993       599167    145635.56
       6.227     0.999994       599168    163840.00
       6.227     0.999995       599168    187245.71
       6.231     0.999995       599169    218453.33
       6.231     0.999996       599169    262144.00
       6.231     0.999997       599169    291271.11
       6.555     0.999997       599170    327680.00
       6.555     0.999997       599170    374491.43
       6.555     0.999998       599170    436906.67
       6.555     0.999998       599170    524288.00
       6.555     0.999998       599170    582542.22
       7.411     0.999998       599171    655360.00
       7.411     1.000000       599171          inf
#[Mean    =        1.035, StdDeviation   =        0.439]
#[Max     =        7.408, Total count    =       599171]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  899661 requests in 30.00s, 729.24MB read
Requests/sec:  29992.41
Transfer/sec:     24.31MB